IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_RTI0_CFG.xml
<module name="MCU_RTI0_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_GCTRL" acronym="CFG_GCTRL" offset="0x0" width="32" description="">
		<bitfield id="NTUSEL" width="4" begin="19" end="16" resetval="0x0" description="  These bits determine which NTU input signal is used as external timebase. There are up to  four inputs supported with four valid selection combinations. Any invalid selection value  written to the NTUSEL bit-field will result in a TIED LOW being used as the NTU signal. The  NTU signal will also be TIED LOW in case of a single-bit flip as it will result in an invalid  combination of NTUSEL.  User and privilege mode (read):  0000 = NTU0  0101 = NTU1  1010 = NTU2  1111 = NTU3  other = tied to '0'  Privilege mode (write):  0000 = NTU0  0101 = NTU1  1010 = NTU2  1111 = NTU3  other = tied to '0' " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="COS" width="1" begin="15" end="15" resetval="0x0" description="  This bit determines if both counters are stopped when the device goes into debug mode or  if they continue counting.  User and privilege mode (read):  0 = counters are stopped while in debug mode  1 = counters are running while in debug mode  Privilege mode (write):  0 = stop counters in debug mode  1 = continue counting in debug mode" range="15" rwaccess="R/W"/> 
		<bitfield id="CNT1EN" width="1" begin="1" end="1" resetval="0x0" description="  The CNT1EN bit starts and stops the operation of counter block 1 (UC1 and FRC1).  User and privilege mode (read):  0 = counters are stopped  1 = counters are running  Privilege mode (write):  0 = stop counters  1 = start counters " range="1" rwaccess="R/W"/> 
		<bitfield id="CNT0EN" width="1" begin="0" end="0" resetval="0x0" description="  The CNT0EN bit starts and stops the operation of counter block 0 (UC0 and FRC0).  User and privilege mode (read):  0 = counters are stopped  1 = counters are running  Privilege mode (write):  0 = stop counters  1 = start counters" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TBCTRL" acronym="CFG_TBCTRL" offset="0x4" width="32" description="">
		<bitfield id="INC" width="1" begin="1" end="1" resetval="0x0" description="  This bit determines wether the Free Running Counter 0 is automatically incremented if a  failing clock on the NTUx signal is detected.  User and privilege mode (read):  0 = FRC0 will not be incremented  1 = FRC0 will be incremented  Privilege mode (write):  0 = Do not increment FRC0 on failing external clock  1 = Increment FRC0 on failing external clock " range="1" rwaccess="R/W"/> 
		<bitfield id="TBEXT" width="1" begin="0" end="0" resetval="0x0" description="  The Timebase External bit selects whether the Free Running Counter 0 is clocked by the  internal Up Counter 0 or from the external signal NTUx. Since setting the TBEXT bit to 1  resets Up Counter 0, Free Running Counter 0 will not be incremented in this occurence.  The only source which is able to increment Free Running Counter 0 is NTUx.  When the Timebase Supervisor circuit detects a missing clockedge, then the TBEXT bit is  reset.  The selection if the external signal should be used, can only be done by software.  User and privilege mode (read):  0 = UC0 clocks FRC0  1 = NTUx clocks FRC0  Privilege mode (write):  0 = MUX is switched to internal UC0 clocking scheme  1 = MUX is switched to external NTUx clocking scheme" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_CAPCTRL" acronym="CFG_CAPCTRL" offset="0x8" width="32" description="">
		<bitfield id="CAPCNTR1" width="1" begin="1" end="1" resetval="0x0" description="  This bit determines, which external interrupt source triggers a capture event of both UC1  and FRC1.  User and privilege mode (read):  0 = capture event is triggered by Capture Event Source 0  1 = capture event is triggered by Capture Event Source 1  Privilege mode (write):  0 = enable capture event triggered by Capture Event Source 0  1 = enable capture event triggered by Capture Event Source 1 " range="1" rwaccess="R/W"/> 
		<bitfield id="CAPCNTR0" width="1" begin="0" end="0" resetval="0x0" description="  This bit determines, which external interrupt source triggers a capture event of both UC0  and FRC0.  User and privilege mode (read):  0 = capture event is triggered by Capture Event Source 0  1 = capture event is triggered by Capture Event Source 1  Privilege mode (write):  0 = enable capture event triggered by Capture Event Source 0  1 = enable capture event triggered by Capture Event Source 1" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_COMPCTRL" acronym="CFG_COMPCTRL" offset="0xC" width="32" description="">
		<bitfield id="COMPSEL3" width="1" begin="12" end="12" resetval="0x0" description="  This bit determines the counter with which the compare value hold in compare register 3 is  compared.  User and privilege mode (read):  0 = value will be compared with FRC 0  1 = value will be compared with FRC 1  Privilege mode (write):  0 = enable compare with FRC 0  1 = enable compare with FRC 1 " range="12" rwaccess="R/W"/> 
		<bitfield id="COMPSEL2" width="1" begin="8" end="8" resetval="0x0" description="  This bit determines the counter with which the compare value hold in compare register 2 is  compared.  User and privilege mode (read):  0 = value will be compared with FRC 0  1 = value will be compared with FRC 1  Privilege mode (write):  0 = enable compare with FRC 0  1 = enable compare with FRC 1 " range="8" rwaccess="R/W"/> 
		<bitfield id="COMPSEL1" width="1" begin="4" end="4" resetval="0x0" description="  This bit determines the counter with which the compare value hold in compare register 1 is  compared. User and privilege mode (read):  0 = value will be compared with FRC 0  1 = value will be compared with FRC 1  Privilege mode (write):  0 = enable compare with FRC 0  1 = enable compare with FRC 1 " range="4" rwaccess="R/W"/> 
		<bitfield id="COMPSEL0" width="1" begin="0" end="0" resetval="0x0" description="  This bit determines the counter with which the compare value hold in compare register 0 is  compared.  User and privilege mode (read):  0 = value will be compared with FRC 0  1 = value will be compared with FRC 1  Privilege mode (write):  0 = enable compare with FRC 0  1 = enable compare with FRC 1" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_FRC0" acronym="CFG_FRC0" offset="0x10" width="32" description="">
		<bitfield id="FRC0" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds the current value of the Free Running Counter 0 and will be updated  continuously.  User and privilege mode (read):  current value of the counter  Privilege mode (write):  The counter can be preset by writing to this register. The counter increments then from this  written value upwards.  Note: Presetting counters  If counters have to be preset, they have to be stopped from counting in the RTIGCTRL  register in order to ensure consistency between RTIUC0 and RTIFRC0." range="31 - 0" rwaccess="R/W"/>
	</register>
