IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_RTI0_CFG.xml
	<register id="CFG_UC0" acronym="CFG_UC0" offset="0x14" width="32" description="">
		<bitfield id="UC0" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds the current value of the Up Counter 0 and prescales the RTI clock. It  will be only updated by a previous read of Free Running Counter 0. This gives effectively a  64 bit read of both counters, without having the problem of a counter being updated  between two consecutive reads on Up Counter 0 and Free Running Counter 0.  User and privilege mode (read):  value of the counter when the Free Running Counter 0 was read  Privilege mode (write):  the counter can be preset by writing to this register. The counter increments then from this  written value upwards.  Note: Presetting counters  If counters have to be preset, they have to be stopped from counting in the RTIGCTRL  register in order to ensure consistency between RTIUC0 and RTIFRC0.  Note: Preset value concern  If the preset value is bigger than the compare value stored in register RTICPUC0 then  it can take a long time until a compare matches, since RTIUC0 has to count up until  it overflows." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_CPUC0" acronym="CFG_CPUC0" offset="0x18" width="32" description="">
		<bitfield id="CPUC0" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds the compare value, which is compared with the Up Counter 0. When  the compare matches, Free Running counter 0 is incremented. The Up Counter is set to  zero when the counter value matches the CPUC0 value. The value set in this prescales the  RTI clock.  If CPUC0 = 0: fFRC0 = R-----T---I---C----L----K--  232  If CPUC0 0: fFRC0 = ----R----T----I--C-----L---K-------  CPUC0 + 1  User and privilege mode (read):  current compare value  Privilege mode (write when TBEXT = 0):  the compare value is updated  Privilege mode (write when TBEXT = 1):  the compare value is not changed" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_CAFRC0" acronym="CFG_CAFRC0" offset="0x20" width="32" description="">
		<bitfield id="CAFRC0" width="32" begin="31" end="0" resetval="0x0" description="  This registers captures the current value of the Free Running Counter 0 when a event  occurs, controlled by the external capture control block.  User and privilege mode (read):  value of Free Running Counter 0 on a capture event" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_CAUC0" acronym="CFG_CAUC0" offset="0x24" width="32" description="">
		<bitfield id="CAUC0" width="32" begin="31" end="0" resetval="0x0" description="  This registers captures the current value of the Up Counter 0 when a event occurs,  controlled by the external capture control block. The read sequence has to be the same as  with Up Counter 0 and Free Running Counter 0. So the RTICAFRC0 register has to be  read first, before the RTICAUC0 register is read. This sequence ensures that the value of  the RTICAUC0 register is the corresponding value to the RTICAFRC0 register, even if  another capture event happens in between the two reads.  User and privilege mode (read):  value of Up Counter 0 on a capture event" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_FRC1" acronym="CFG_FRC1" offset="0x30" width="32" description="">
		<bitfield id="FRC1" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds the current value of the Free Running Counter 1 and will be updated  continuously.  User and privilege mode (read):  current value of the counter  Privilege mode (write):  the counter can be preset by writing to this register. The counter increments then from this  written value upwards.  Note: Presetting counters  If counters have to be preset, they have to be stopped from counting in the RTIGCTRL  register in order to ensure consistency between UC1 and FRC1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_UC1" acronym="CFG_UC1" offset="0x34" width="32" description="">
		<bitfield id="UC1" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds the current value of the Up Counter 1 and prescales the RTI clock. It  will be only updated by a previous read of Free Running Counter 1. This gives effectively a  64 bit read of both counters, without having the problem of a counter being updated  between two consecutive reads on Up Counter 1 and Free Running Counter 1.  User and privilege mode (read):  value of the counter when the Free Running Counter 1 was read  Privilege mode (write):  the counter can be preset by writing to this register. The counter increments then from this  written value upwards.  Note: Presetting counters  If counters have to be preset, they have to be disabled in the RTIGCTRL register in  order to ensure consistency between UC1 and FRC1.  Note: Preset value concern  If the preset value is bigger than the compare value stored in register RTICPUC1 then  it can take a long time until a compare matches, since UC1 has to count up until it  overflows." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_CPUC1" acronym="CFG_CPUC1" offset="0x38" width="32" description="">
		<bitfield id="CPUC1" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds the compare value, which is compared with the Up Counter 1. When  the compare matches, Free Running Counter 1 is incremented. The Up Counter is set to  zero when the counter value matches the CPUC1 value. The value set in this prescales the  RTI clock.  If CPUC1 = 0: fFRC1 = R-----T---I---C----L----K--  232  If CPUC1 0: fFRC1 = ----R----T----I--C-----L---K-------  CPUC1 + 1  User and privilege mode (read):  current compare value  Privilege mode (write):  the compare value is updated" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_CAFRC1" acronym="CFG_CAFRC1" offset="0x40" width="32" description="">
		<bitfield id="CAFRC1" width="32" begin="31" end="0" resetval="0x0" description="  This registers captures the current value of the Free Running Counter 1 when a event  occurs, controlled by the external capture control block.  User and privilege mode (read):  value of Free Running Counter 1 on a capture event" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_CAUC1" acronym="CFG_CAUC1" offset="0x44" width="32" description="">
		<bitfield id="CAUC1" width="32" begin="31" end="0" resetval="0x0" description="  This registers captures the current value of the Up Counter 1 when a event occurs,  controlled by the external capture control block. The read sequence has to be the same as  with Up Counter 1 and Free Running Counter 1. So the RTICAFRC1 register has to be  read first, before the RTICAUC1 register is read. This sequence ensures that the value of  the RTICAUC0 register is the corresponding value to the RTICAFRC0 register, even if  another capture event happens in between the two reads.  User and privilege mode (read):  value of Up Counter 1 on a capture event" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_COMP0" acronym="CFG_COMP0" offset="0x50" width="32" description="">
		<bitfield id="COMP0" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, an  interrupt is flagged. With this register it is also possible to initiate a DMA request.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_UDCP0" acronym="CFG_UDCP0" offset="0x54" width="32" description="">
		<bitfield id="UDCP0" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a value, which is added to the value in the compare 0 register each  time a compare matches. This gives the possibility to generate periodic interrupts without  software intervention.  User and privilege mode (read):  value to be added to the compare 0 register on the next compare match  Privilege mode (write):  new update value" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_COMP1" acronym="CFG_COMP1" offset="0x58" width="32" description="">
		<bitfield id="COMP1" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, an  interrupt is flagged. With this register it is also possible to initiate a DMA request.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_UDCP1" acronym="CFG_UDCP1" offset="0x5C" width="32" description="">
		<bitfield id="UDCP1" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a value, which is added to the value in the compare 1 register each  time a compare matches. This gives the possibility to generate periodic interrupts without  software intervention.  User and privilege mode (read):  value to be added to the compare 1 register on the next compare match  Privilege mode (write):  new update value" range="31 - 0" rwaccess="R/W"/>
	</register>
