IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_RTI0_CFG.xml
	<register id="CFG_CLEARINT" acronym="CFG_CLEARINT" offset="0x84" width="32" description="">
		<bitfield id="CLEAROVL1INT" width="1" begin="18" end="18" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable interrupt " range="18" rwaccess="R/W1TC"/> 
		<bitfield id="CLEAROVL0INT" width="1" begin="17" end="17" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable interrupt " range="17" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARTBINT" width="1" begin="16" end="16" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable interrupt" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARDMA3" width="1" begin="11" end="11" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable DMA request " range="11" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARDMA2" width="1" begin="10" end="10" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable DMA request " range="10" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARDMA1" width="1" begin="9" end="9" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable DMA request " range="9" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARDMA0" width="1" begin="8" end="8" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable DMA request " range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARINT3" width="1" begin="3" end="3" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable interrupt " range="3" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARINT2" width="1" begin="2" end="2" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable interrupt " range="2" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARINT1" width="1" begin="1" end="1" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable interrupt " range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CLEARINT0" width="1" begin="0" end="0" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = disable interrupt" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_INTFLAG" acronym="CFG_INTFLAG" offset="0x88" width="32" description="">
		<bitfield id="OVL1INT" width="1" begin="18" end="18" resetval="0x0" description="  User and privilege mode (read):  determines if an interrupt is pending  0 = no interrupt pending  1 = interrupt pending  Privilege mode (write):  0 = leaves the bit unchanged  1 = set the bit to 0 " range="18" rwaccess="R/W1TC"/> 
		<bitfield id="OVL0INT" width="1" begin="17" end="17" resetval="0x0" description="  User and privilege mode (read):  determines if an interrupt is pending  0 = no interrupt pending  1 = interrupt pending  Privilege mode (write):  0 = leaves the bit unchanged  1 = set the bit to 0 " range="17" rwaccess="R/W1TC"/> 
		<bitfield id="TBINT" width="1" begin="16" end="16" resetval="0x0" description="  User and privilege mode (read):  this flag is set when the TBEXT bit is cleared by detection of a missing external clockedge.  It will not be set by clearing TBEXT by software.  determines if an interrupt is pending  0 = no interrupt pending  1 = interrupt pending  Privilege mode (write):  0 = leaves the bit unchanged  1 = set the bit to 0 " range="16" rwaccess="R/W1TC"/> 
		<bitfield id="INT3" width="1" begin="3" end="3" resetval="0x0" description="  User and privilege mode (read):  determines if a interrupt is pending  0 = no interrupt pending  1 = interrupt pending  Privilege mode (write):  0 = leaves the bit unchanged  1 = set the bit to 0 " range="3" rwaccess="R/W1TC"/> 
		<bitfield id="INT2" width="1" begin="2" end="2" resetval="0x0" description="  User and privilege mode (read):  determines if a interrupt is pending  0 = no interrupt pending  1 = interrupt pending  Privilege mode (write):  0 = leaves the bit unchanged  1 = set the bit to 0 " range="2" rwaccess="R/W1TC"/> 
		<bitfield id="INT1" width="1" begin="1" end="1" resetval="0x0" description="  User and privilege mode (read):  determines if a interrupt is pending  0 = no interrupt pending  1 = interrupt pending  Privilege mode (write):  0 = leaves the bit unchanged  1 = set the bit to 0 " range="1" rwaccess="R/W1TC"/> 
		<bitfield id="INT0" width="1" begin="0" end="0" resetval="0x0" description="  User and privilege mode (read):  determines if a interrupt is pending  0 = no interrupt pending  1 = interrupt pending  Privilege mode (write):  0 = leaves the bit unchanged  1 = set the bit to 0" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_DWDCTRL" acronym="CFG_DWDCTRL" offset="0x90" width="32" description="">
		<bitfield id="DWDCTRL" width="32" begin="31" end="0" resetval="0x1393732845" description="  User and priviledge mode (read):  0x5312ACED = DWD counter is disabled. This is the default value.  0xA98559DA = DWD counter is enabled  Any other value = DWD counter state is unchanged (enabled or disabled)  Priviledge mode (write):  0xA98559DA = DWD counter is enabled  Any other value = State of DWD counter is unchanged (stays enabled or disabled)  Note: One-Write Functionality of DWDCTRL Register  The RTIDWDCTRL register implements a one-write functionality, such that the  application cannot write to this registermore than once. Writing the default value will  not enable the watchdog as described above. Writing the enable value will start the  watchdog counters. A write to RTIDWDCTRL will only be enabled after a system reset  again." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DWDPRLD" acronym="CFG_DWDPRLD" offset="0x94" width="32" description="">
		<bitfield id="DWDPRLD" width="12" begin="11" end="0" resetval="0x4095" description="  User and priviledge mode (read):  A read from this register in any CPU mode returns the current preload value.  Priviledge mode (write):  If the DWD is always enabled after reset is released:  The DWD starts counting down from the reset value of the counter, that is, 0x002DFFFF.  The application can configure the DWD preload register any time before this down counter  expires.  When the application services the DWD, the preload register contents are copied left-  justified into the DWD down counter and it starts counting down from that value.  If the DWD is implemented such that the down counter is enabled by software:  The DWD preload register can be configured only when the DWD is disabled. Therefore,  the application can only configure the DWD preload register before it enables the DWD  down counter.  The expiration time of the DWD Down Counter can be determined with following equation:  texp = (RTIDWDPRLD+1) x 213 / RTICLK1  where: RTIDWDPRLD = 0...4095" range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_WDSTATUS" acronym="CFG_WDSTATUS" offset="0x98" width="32" description="">
		<bitfield id="DWWD" width="1" begin="5" end="5" resetval="0x0" description="  This bit denotes whether the time-window defined by the windowed watchdog configuration  has been violated, or if a wrong key or key sequence was written to service the watchdog.  User and priviledge mode (read):  0 = no time-window violation has occurred.  1 = a time-window violation has occurred. The watchdog will generate either a system  reset or a non-maskable interrupt to the CPU in this case.  Priviledge mode (write):  0 = leaves the current value unchanged.  1 = clears the bit to 0. This will also clear all other status flags in the RTIWDSTATUS reg-  ister except for the AWD ST flag. Clearing of the status flags will deassert the non-  maskable interrupt generated due to violation of the DWWD. " range="5" rwaccess="R/W1TC"/> 
		<bitfield id="END" width="1" begin="4" end="4" resetval="0x0" description="  This bit denotes whether the end-time defined by the windowed watchdog configuration  has been violated. This bit is effectively a copy of the DWD ST status flag.  User and priviledge mode (read):  0 = no end-time window violation has occurred.  1 = the end-time defined by the windowed watchdog configuration has been violated.  Priviledge mode (write):  0 = leaves the current value unchanged.  1 = clears the bit to 0. " range="4" rwaccess="R/W1TC"/> 
		<bitfield id="START" width="1" begin="3" end="3" resetval="0x0" description="  This bit denotes whether the start-time defined by the windowed watchdog configuration  has been violated. This indicates that the WWD was serviced before the service window  was opened.  User and priviledge mode (read):  0 = no start-time window violation has occurred.  1 = the start-time defined by the windowed watchdog configuration has been violated.  Priviledge mode (write):  0 = leaves the current value unchanged.  1 = clears the bit to 0. " range="3" rwaccess="R/W1TC"/> 
		<bitfield id="KEYST" width="1" begin="2" end="2" resetval="0x0" description="This bit denotes a reset generated by a wrong key or a wrong key-sequence written to the  RTIWDKEY register.  User and priviledge mode (read):  0 = no wrong key or key-sequence written  1 = wrong key or key-sequence written to RTIWDKEY register  Priviledge mode (write):  0 = leaves the current value unchanged  1 = clears the bit to 0 " range="2" rwaccess="R/W1TC"/> 
		<bitfield id="DWDST" width="1" begin="1" end="1" resetval="0x0" description="  status flag and is maintained for compatibility reasons.  User and priviledge mode (read):  0 = DWD timeout period not expired  1 = DWD timeout period has expired  Priviledge mode (write):  0 = leaves the current value unchanged  1 = clears the bit to 0 " range="1" rwaccess="R/W1TC"/> 
		<bitfield id="AWDST" width="1" begin="0" end="0" resetval="0x0" description="User and priviledge mode (read):  0 = AWD pin 0 > 1 threshold not exceeded  1 = AWD pin 0 > 1 threshold exceeded  Priviledge mode (write):  0 = leaves the current value unchanged  1 = clears the bit to 0" range="0" rwaccess="R/W1TC"/>
	</register>
